ab.out
This is ApacheBench, Version 2.3 <$Revision: 1826891 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            1337

Document Path:          /
Document Length:        17 bytes

Concurrency Level:      121
Time taken for tests:   0.076 seconds
Complete requests:      400
Failed requests:        0
Total transferred:      25600 bytes
HTML transferred:       6800 bytes
Requests per second:    5230.19 [#/sec] (mean)
Time per request:       23.135 [ms] (mean)
Time per request:       0.191 [ms] (mean, across all concurrent requests)
Transfer rate:          326.89 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    7   2.1      7      11
Processing:     2   12   3.7     13      18
Waiting:        1   12   3.8     12      18
Total:         12   19   3.1     19      25

Percentage of the requests served within a certain time (ms)
  50%     19
  66%     20
  75%     22
  80%     22
  90%     23
  95%     24
  98%     25
  99%     25
 100%     25 (longest request)